perftests/run4.log
hey -z 30s -m GET -cpus 4 -c 200 -H "Authorization: icandowhatiwant" http://localhost:9000/performance

Summary:
  Total:	30.0064 secs
  Slowest:	0.1204 secs
  Fastest:	0.0000 secs
  Average:	0.0061 secs
  Requests/sec:	32800.8955
  
  Total data:	117116111 bytes
  Size/request:	119 bytes

Response time histogram:
  0.000 [1]	|
  0.012 [842101]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.024 [119449]	|■■■■■■
  0.036 [18002]	|■
  0.048 [3367]	|
  0.060 [773]	|
  0.072 [265]	|
  0.084 [114]	|
  0.096 [64]	|
  0.108 [23]	|
  0.120 [10]	|


Latency distribution:
  10% in 0.0001 secs
  25% in 0.0015 secs
  50% in 0.0043 secs
  75% in 0.0086 secs
  90% in 0.0144 secs
  95% in 0.0189 secs
  99% in 0.0303 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.1204 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0022 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0167 secs
  resp wait:	0.0060 secs, 0.0000 secs, 0.1203 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0350 secs

Status code distribution:
  [400]	984169 responses

Error distribution:
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57580->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57581->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57582->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57583->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57584->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57585->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57586->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57587->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57588->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57589->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57590->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57591->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57592->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57593->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57594->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57595->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57596->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57597->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57598->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57599->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57600->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57601->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57602->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57603->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57604->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57605->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57606->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57607->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57608->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57609->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57610->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57611->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57612->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57613->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57614->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57615->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57616->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57617->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57618->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57619->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57620->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57621->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57622->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57623->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57624->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57625->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57626->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57627->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57628->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57629->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57630->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57631->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57632->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57633->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57634->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57635->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57636->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57637->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57638->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57639->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57640->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57641->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57642->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57643->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57644->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57645->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57646->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57647->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:57648->[::1]:9000: read: connection reset by peer